yenchouRJ/nuc990_non-os/SampleCode/StdDriver/USBH_MassStorage/main.c
void put_rc (FRESULT rc)
{
    const TCHAR *p =
        _T("OK\0DISK_ERR\0INT_ERR\0NOT_READY\0NO_FILE\0NO_PATH\0INVALID_NAME\0")
        _T("DENIED\0EXIST\0INVALID_OBJECT\0WRITE_PROTECTED\0INVALID_DRIVE\0")
        _T("NOT_ENABLED\0NO_FILE_SYSTEM\0MKFS_ABORTED\0TIMEOUT\0LOCKED\0")
        _T("NOT_ENOUGH_CORE\0TOO_MANY_OPEN_FILES\0");
    //FRESULT i;
    uint32_t i;
    for (i = 0; (i != (UINT)rc) && *p; i++)
    {
        while(*p++) ;
    }
    printf(_T("rc=%d FR_%s\n"), (UINT)rc, p);
}

/*----------------------------------------------*/
/* Get a line from the input                    */
/*----------------------------------------------*/
void get_line (char *buff, int len)
{
    TCHAR c;
    int idx = 0;

    for (;;)
    {
        c = getchar();
        putchar(c);
        fflush(stdout);

        if (c == '\r') break;
        if ((c == '\b') && idx) idx--;
        if ((c >= ' ') && (idx < len - 1)) buff[idx++] = c;
    }
    buff[idx] = 0;

    putchar('\n');
    fflush(stdout);
}

/*---------------------------------------------------------*/
/* User Provided RTC Function for FatFs module             */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called from     */
/* FatFs module. Any valid time must be returned even if   */
/* the system does not support an RTC.                     */
/* This function is not required in read-only cfg.         */
unsigned long get_fattime (void)
{
    unsigned long tmr;

    tmr=0x00000;

    return tmr;
}

void SYS_Init()
{
    SYS_UnlockReg();

    CLK_SetModuleClock(UART0_MODULE, CLK_DIV4_UART0SEL_HXT, CLK_DIV4_UART0(1));

    CLK_EnableModuleClock(USBH_MODULE);
    CLK_EnableModuleClock(TMR0_MODULE);
    CLK_EnableModuleClock(UART0_MODULE);

    /* set USRHDSEN as 1; USB host/device role selection decided by USBID (SYS_PWRON[16]) */
    SYS->MISCFCR |= SYS_MISCFCR_USRHDSEN_Msk;

    /* set USB port 0 used for Host */
    SYS->PWRON |= SYS_PWRON_USBID_Msk;

    SET_USB_OVC_PE10();
    SET_USBH_PWREN_PE12();

    SET_UART0_RXD_PF11();
    SET_UART0_TXD_PF12();
}

void UART0_Init(void)
{
    sysResetModule(UART0_RST);
    UART_Open(UART0, 115200);
    UART0->BAUD = 0x3000000E;  /* for palladium */
}

/*----------------------------------------------------------------------------
  MAIN function
 *----------------------------------------------------------------------------*/
int32_t main(void)
{
    char    *ptr, *ptr2;
    long    p1, p2, p3;
    BYTE    *buf;
    FATFS   *fs;              /* Pointer to file system object */
    TCHAR   usb_path[] = { '3', ':', 0 };    /* USB drive started from 3 */
    char    cmd_backup[128];
    FRESULT res;
    DIR dir;                /* Directory object */
    UINT s1, s2, cnt;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;

    SYS_UnlockReg();

    sysDisableCache();
    sysFlushCache(I_D_CACHE);
    sysEnableCache(CACHE_WRITE_BACK);

    SYS_Init();

    UART0_Init();

    Start_TIMER0();

    printf("\n\n");
    printf("+-----------------------------------------------+\n");
    printf("|                                               |\n");
    printf("|     USB Host Mass Storage sample program      |\n");
    printf("|                                               |\n");
    printf("+-----------------------------------------------+\n");

    Buff = nc_ptr(&Buff_Pool[0]);
    Buff2 = nc_ptr(&Buff_Pool[BUFF_SIZE]);

    usbh_core_init();
    usbh_umas_init();
    usbh_pooling_hubs();

    f_chdrive(usb_path);          /* set default path */

    for (;;)
    {
        printf("EHCI: 0x%x, 0x%x;  OHCI: 0x%x, 0x%x\n", HSUSBH->UPSCR[0], HSUSBH->UPSCR[1], USBH->HcRhPortStatus[0], USBH->HcRhPortStatus[1]);

        usbh_pooling_hubs();

        printf(_T(">"));
        ptr = Line;

        fflush(stdout);

        while (kbhit())
            usbh_pooling_hubs();

        get_line(ptr, sizeof(Line));

        switch (*ptr++)
        {

        case 'q' :  /* Exit program */
            return 0;

        case '4' :
        case '5' :
        case '6' :
        case '7' :
            ptr--;
            *(ptr+1) = ':';
            *(ptr+2) = 0;
            put_rc(f_chdrive((TCHAR *)ptr));
            break;

        case '#':
            for (p1 = 0; p1 < 10000000; p1 += 8)
            {
                res = (FRESULT)disk_read(3, Buff, p1, 8);
                printf("Read sector %d, rc=%d\n", p1, (WORD)res);
                if (res)
                {
                    break;
                }
            }
            break;

        case 'd' :
            switch (*ptr++)
            {
                case 'd' :  /* dd [<lba>] - Dump sector */
                    if (!xatoi(&ptr, &p2)) p2 = sect;
                    res = (FRESULT)disk_read(3, Buff, p2, 1);
                    if (res)
                    {
                        printf("rc=%d\n", (WORD)res);
                        break;
                    }
                    sect = p2 + 1;
                    printf("Sector:%d\n", p2);
                    for (buf=(unsigned char*)Buff, ofs = 0; ofs < 0x200; buf+=16, ofs+=16)
                        put_dump(buf, ofs, 16);
                    break;

            }
            break;

        case 'b' :
            switch (*ptr++)
            {
                case 'd' :  /* bd <addr> - Dump R/W buffer */
                    if (!xatoi(&ptr, &p1)) break;
                    for (ptr=(char*)&Buff[p1], ofs = p1, cnt = 32; cnt; cnt--, ptr+=16, ofs+=16)
                        put_dump((BYTE*)ptr, ofs, 16);
                    break;

                case 'e' :  /* be <addr> [<data>] ... - Edit R/W buffer */
                    if (!xatoi(&ptr, &p1)) break;
                    if (xatoi(&ptr, &p2))
                    {
                        do
                        {
                            Buff[p1++] = (BYTE)p2;
                        }
                        while (xatoi(&ptr, &p2));
                        break;
                    }
                    for (;;)
                    {
                        printf("%04X %02X-", (WORD)p1, Buff[p1]);
                        get_line(Line, sizeof(Line));
                        ptr = Line;
                        if (*ptr == '.') break;
                        if (*ptr < ' ')
                        {
                            p1++;
                            continue;
                        }
                        if (xatoi(&ptr, &p2))
                            Buff[p1++] = (BYTE)p2;
                        else
                            printf("???\n");
                    }
                    break;

